export type Spades =
  | '🂡'
  | '🂢'
  | '🂣'
  | '🂤'
  | '🂥'
  | '🂦'
  | '🂧'
  | '🂨'
  | '🂩'
  | '🂪'
  | '🂫'
  | '🂬'
  | '🂭'
  | '🂮';

export type Hearts =
  | '🂱'
  | '🂲'
  | '🂳'
  | '🂴'
  | '🂵'
  | '🂶'
  | '🂷'
  | '🂸'
  | '🂹'
  | '🂺'
  | '🂻'
  | '🂼'
  | '🂽'
  | '🂾';

export type Diamonds =
  | '🃁'
  | '🃂'
  | '🃃'
  | '🃄'
  | '🃅'
  | '🃆'
  | '🃇'
  | '🃈'
  | '🃉'
  | '🃊'
  | '🃋'
  | '🃌'
  | '🃍'
  | '🃎';

export type Clubs =
  | '🃑'
  | '🃒'
  | '🃓'
  | '🃔'
  | '🃕'
  | '🃖'
  | '🃗'
  | '🃘'
  | '🃙'
  | '🃚'
  | '🃛'
  | '🃜'
  | '🃝'
  | '🃞';

export type Card = Spades | Hearts | Diamonds | Clubs;
